% %2.1
% Один действительный полюс р = -5
zeros1 = [];
poles1 = -5;
gain1 = 1;
sys1 = zpk(zeros1, poles1, gain1);

% Один действительный полюс р = +5
zeros2 = [];
poles2 = 5;
gain2 = 1;
sys2 = zpk(zeros2, poles2, gain2);

% Пара комплексных полюсов р = -5 ± 2j
zeros3 = [];
poles3 = [complex(-5, 2), complex(-5, -2)];
gain3 = 1;
sys3 = zpk(zeros3, poles3, gain3);

% Пара комплексных полюсов р = 0 ± 5j
zeros4 = [];
poles4 = [complex(0, 5), complex(0, -5)];
gain4 = 1;
sys4 = zpk(zeros4, poles4, gain4);

% Пара комплексных полюсов р = +5 ± 2j
zeros5 = [];
poles5 = [complex(5, 2), complex(5, -2)];
gain5 = 1;
sys5 = zpk(zeros5, poles5, gain5);

%2.2
disp('-----Пункт 2.2-----');

% Проверка полюсов sys1
disp('Полюсы системы 1:');
disp(pole(sys1));

% Проверка устойчивости
if isstable(sys1)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys2
disp('Полюсы системы 2:');
disp(pole(sys2));

% Проверка устойчивости
if isstable(sys2)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys3
disp('Полюсы системы 3:');
disp(pole(sys3));

% Проверка устойчивости
if isstable(sys3)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys4
disp('Полюсы системы 4:');
disp(pole(sys4));

% Проверка устойчивости
if isstable(sys4)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys5
disp('Полюсы системы 5:');
disp(pole(sys5));

% Проверка устойчивости
if isstable(sys5)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

%2.3
disp('-----Пункт 2.3-----');
disp('-----Вывод графиков-----');
% Для sys1
figure(1);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы1
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y1, t1] = step(sys1);
% Построение графика переходного процесса
plot(t1, y1);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys1);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% Для sys2
figure(2);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы2
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y2, t2] = step(sys2);
% Построение графика переходного процесса
plot(t2, y2);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys2);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% Для sys3
figure(3);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы3
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y3, t3] = step(sys3);
% Построение графика переходного процесса
plot(t3, y3);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys3);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% % Для sys4
figure(4);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы4
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y4, t4] = step(sys4);
% Построение графика переходного процесса
plot(t4, y4);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys4);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% % Для sys5
figure(5);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы5
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y5, t5] = step(sys5);
% Построение графика переходного процесса
plot(t5, y5);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys5);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% %2.4
disp('-----Пункт 2.4------');
%2.1_mode
% Один действительный полюс р = -10
zeros1_mod = [];
poles1_mod = -10;
gain1_mod = 1;
sys1_mod = zpk(zeros1_mod, poles1_mod, gain1_mod);

% Один действительный полюс р = +10
zeros2_mod = [];
poles2_mod = 10;
gain2_mod = 1;
sys2_mod = zpk(zeros2_mod, poles2_mod, gain2_mod);

% Пара комплексных полюсов р = -10 ± 2j
zeros3_mod = [];
poles3_mod = [complex(-10, 2), complex(-10, -2)];
gain3_mod = 1;
sys3_mod = zpk(zeros3_mod, poles3_mod, gain3_mod);

% Пара комплексных полюсов р = 0 ± 10j
zeros4_mod = [];
poles4_mod = [complex(0, 10), complex(0, -10)];
gain4_mod = 1;
sys4_mod = zpk(zeros4_mod, poles4_mod, gain4_mod);

% Пара комплексных полюсов р = +10 ± 2j
zeros5_mod = [];
poles5_mod = [complex(10, 2), complex(10, -2)];
gain5_mod = 1;
sys5_mod = zpk(zeros5_mod, poles5_mod, gain5_mod);


% %2.2_mode
disp('-----Пункт 2.2_mode-----');

% Проверка полюсов sys1_mod
disp('Полюсы системы 1_mod:');
disp(pole(sys1_mod));

% Проверка устойчивости
if isstable(sys1_mod)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys2_mod
disp('Полюсы системы 2_mod:');
disp(pole(sys2_mod));

% Проверка устойчивости
if isstable(sys2_mod)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys3_mod
disp('Полюсы системы 3_mod:');
disp(pole(sys3_mod));

% Проверка устойчивости
if isstable(sys3_mod)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys4_mod
disp('Полюсы системы 4_mod:');
disp(pole(sys4_mod));

% Проверка устойчивости
if isstable(sys4_mod)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

% Проверка полюсов sys5_mod
disp('Полюсы системы 5_mod:');
disp(pole(sys5_mod));

% Проверка устойчивости
if isstable(sys5_mod)
    disp('Система устойчива.');
else
    disp('Система неустойчива.');
end

%2.3_mod
disp('-----Пункт 2.3_mod-----');
disp('-----Вывод графиков-----');
% Для sys1_mod
figure(6);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы1
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y1_mod, t1_mod] = step(sys1_mod);
% Построение графика переходного процесса
plot(t1_mod, y1_mod);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys1_mod);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% Для sys2_mod
figure(7);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы2
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y2_mod, t2_mod] = step(sys2_mod);
% Построение графика переходного процесса
plot(t2_mod, y2_mod);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys2_mod);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% Для sys3_mod
figure(8);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы3
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y3_mod, t3_mod] = step(sys3_mod);
% Построение графика переходного процесса
plot(t3_mod, y3_mod);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys3_mod);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% % Для sys4_mod
figure(9);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы4
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y4_mod, t4_mod] = step(sys4_mod);
% Построение графика переходного процесса
plot(t4_mod, y4_mod);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys4_mod);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

% % Для sys5_mod
figure(10);
% Пункт 3: График переходного процесса и карта нулей и полюсов для системы5
subplot(1, 2, 1);
% Получение данных для графика переходного процесса
[y5_mod, t5_mod] = step(sys5_mod);
% Построение графика переходного процесса
plot(t5_mod, y5_mod);
title('Переходной процесс');
xlabel('t');
ylabel('y(t)');

subplot(1, 2, 2);
% Построение карты нулей и полюсов
pzmap(sys5_mod);
title('Карта нулей и полюсов');
xlabel('Сигма');
ylabel('jw');

%2.5
disp('-----Пункт 2.5-----');
% Для sys1
% Преобразование в описание в пространстве состояний
sys1_ss = ss(sys1);

% Вывод матрицы состояния A
disp('Матрица состояния A для системы с полюсом -5:');
disp(sys1_ss.A);

% Определение собственных значений матрицы состояния A
eigenvalues = eigs(sys1_ss.A);

% Вывод собственных значений и вывод об устойчивости
disp('Собственные значения матрицы состояния A:');
disp(eigenvalues);

% Вывод об устойчивости системы
if all(real(eigenvalues) < 0)
    disp('Система устойчива.');
else
    disp('Система неустойчива или находится на границе устойчивости.');
end

% Для sys2
sys2_ss = ss(sys2);
disp('Собственные значения матрицы состояния для sys2:');
disp(eigs(sys2_ss.A));

% Для sys3
sys3_ss = ss(sys3);
disp('Собственные значения матрицы состояния для sys3:');
disp(eigs(sys3_ss.A));

% Для sys4
sys4_ss = ss(sys4);
disp('Собственные значения матрицы состояния для sys4:');
disp(eigs(sys4_ss.A));

% Для sys5
sys5_ss = ss(sys5);
disp('Собственные значения матрицы состояния для sys5:');
disp(eigs(sys5_ss.A));
